## Metro Scooters Analysis
In May of 2018, Bird dropped hundreds of scooters on the streets of Nashville with no permission. In response, Metro sued, which caused Bird to remove and wait for permits. Metro began developing regulations for scooters and other shared urban mobility devices (SUMDs). In 2019, the Metro Council passed legislation enacting a one-year pilot program for scooters. For this project, you have been provided with the data for 3 months of this pilot program with the goal of reporting on usage trends and generating recommendations for quantity and distribution of scooters in Nashville.

Metro would like to know what the ideal density of available scooters is, which balances the objectives of
enabling scooters to serve transportation goals,
discouraging scooters from piling up on sidewalks,
keeping it economically viable for companies to operate equitably in the city.

This data for this project can be downloaded as a Postgres backup from https://drive.google.com/file/d/1BXAfByFvHCwX0G1BvTCQ373qKm7wE4Y-/view?usp=share_link.

Some notes about the data:
* When not in use, each scooter will report its location every five minutes. This data is contained in the scooters table.
* WARNING: Both tables contain a large number of records, so think carefully about what data you need to pull in a given query. If you try and pull in all rows from the scooters table, there is a very good chance that you will crash your notebook!

In [38]:
from sqlalchemy import create_engine, text
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt

In [2]:
database_name = 'scooters'

connection_string = f'postgresql://postgres:postgres@localhost:5432/{database_name}'

engine = create_engine(connection_string)

In [3]:
query = '''
SELECT companyname, SUM(tripduration)
FROM trips
WHERE tripduration IS NOT NULL
GROUP BY companyname'''

pd.read_sql(query, con = engine)

     companyname           sum
0           Bird  2.046202e+06
1  Bolt Mobility  3.082150e+07
2         Gotcha  3.380278e+04
3           JUMP  2.110013e+05
4           Lime  3.507335e+06
5           Lyft  1.936370e+06
6           SPIN  9.005750e+05

In [4]:
query = '''
SELECT *
FROM trips
'''

trips = pd.read_sql(query, con = engine)

In [5]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 565522 entries, 0 to 565521
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   pubtimestamp    565522 non-null  datetime64[ns]
 1   companyname     565522 non-null  object
 2   triprecordnum   565522 non-null  object
 3   sumdid          565522 non-null  object
 4   tripduration    565522 non-null  float64
 5   tripdistance    565522 non-null  float64
 6   startdate       565522 non-null  object
 7   starttime       565522 non-null  object
 8   enddate         565522 non-null  object
 9   endtime         565522 non-null  object
 10  startlatitude   565522 non-null  float64
 11  startlongitude  565522 non-null  float64
 12  endlatitude     565522 non-null  float64
 13  endlongitude    565522 non-null  float64
 14  triproute       565522 non-null  object
 15  create_dt       565522 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(6), object(8)
memory usage: 69.0+ MB

In [7]:
query = '''
SELECT *
FROM scooters
LIMIT 5'''

pd.read_sql(query, con = engine)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-09 09:30:12,36.1199,-86.7535,Powered7179eba6-2522-5423-b6c8-7c6b74ce00f6,Powered,0.0,scooter,0.06,Jump
1,2019-07-09 09:30:12,36.1198,-86.7535,Powered743768be-96db-5dac-86f3-a99dacad31b8,Powered,30.0,scooter,0.06,Jump
2,2019-07-09 09:30:12,36.1201,-86.7532,Powered4e6cf747-22dc-5d50-8dbd-830d6ab8ca71,Powered,0.0,scooter,0.06,Jump
3,2019-07-09 09:30:12,36.1203,-86.7534,Powered70e93b4e-0895-59ac-b16d-1b53f04c1dc3,Powered,94.0,scooter,0.06,Jump
4,2019-07-09 09:30:12,36.1197,-86.7529,Powered05fee9e1-d132-5e4f-88cd-153058d391fa,Powered,0.0,scooter,0.06,Jump

In [18]:
query = '''
SELECT *
FROM scooters
WHERE latitude IS NULL
    OR longitutde IS NULL'''

pd.read_sql(query, con = engine)

Empty DataFrame
Columns: [pubdatetime, latitude, longitude, sumdid, sumdtype, chargelevel, sumdgroup, costpermin, companyname]
Index: []

In [20]:
trips.startdate.min()

datetime.date(2019, 5, 1)

In [21]:
trips.startdate.max()

datetime.date(2019, 7, 31)

In [23]:
query = '''
SELECT min(pubdatetime)
FROM scooters'''

pd.read_sql(query, con = engine)

                      min
0 2019-05-01 00:01:41.247

In [24]:
query = '''
SELECT max(pubdatetime)
FROM scooters'''

pd.read_sql(query, con = engine)

                  max
0 2019-07-31 23:59:57

In [28]:
query = '''
SELECT COUNT(*)
FROM scooters
'''

pd.read_sql(query, con = engine)

      count
0  73414043

In [29]:
#- Is time represented with am/pm or using 24 hour values in each of the columns that include time?

In [30]:
query = '''
SELECT *
FROM scooters
LIMIT 1'''

pd.read_sql(query, con = engine)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-09 09:30:12,36.1199,-86.7535,Powered7179eba6-2522-5423-b6c8-7c6b74ce00f6,Powered,0.0,scooter,0.06,Jump

In [31]:
trips.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [32]:
#ANSWER: both tables are using 24-hour time

In [33]:
#- What values are there in the sumdgroup column? Are there any that are not of interest for this project?

In [34]:
#ANSWER: The sumdgroup column in the scooters table are: “bicycle”, "Scooter", and “scooter”.
#The only values of interest are the "scooter" and "Scooter" values.

In [35]:
query = '''
SELECT DISTINCT sumdgroup
FROM scooters'''

pd.read_sql(query, con = engine)

  sumdgroup
0   Scooter
1   bicycle
2   scooter

In [36]:
#- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?

In [39]:
query = '''
SELECT 
    MIN(latitude) AS min_lat,
    MAX(latitude) AS max_lat,
    MIN(longitude) AS min_lon,
    MAX(longitude) AS max_lon
FROM scooters;
'''

with engine.connect() as connection:
    scoots = pd.read_sql(text(query), con = connection)

scoots

   min_lat       max_lat    min_lon  max_lon
0      0.0  3.609874e+06 -97.443879      0.0

ANSWER: The max latitude is too large. Minimum longitutde is the only correct value.

What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.

In [42]:
trips.tripduration.min()

-19.3582666667

In [43]:
trips.tripduration.max()

512619.0

In [44]:
trips.tripdistance.max()

31884482.6476

In [45]:
trips.tripdistance.min()

-20324803.8

ANSWER: The minimum values for trip duration and trip distance are questionable because they're negative. The trip distance maximum also indicates the trip is around 6000 miles which is questionable as well. The trip duration max is around 8500 hours which is also questionable.

Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [46]:
query = '''
SELECT DISTINCT companyname
FROM scooters'''

pd.read_sql(query, con = engine)

  companyname
0        Bird
1        Bolt
2      Gotcha
3        Jump
4        Lime
5        Lyft
6        Spin

In [48]:
trips.companyname.unique()

array(['Bird', 'Lyft', 'Lime', 'Bolt Mobility', 'SPIN', 'Gotcha', 'JUMP'],
      dtype=object)

ANSWER: The company names have different capitalizations in each table. 'Bolt' is titled 'Bolt Mobility' in the trips table.

1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [63]:
query = '''
SELECT companyname, COUNT(DISTINCT sumdid)
FROM scooters
WHERE sumdgroup ilike 'scooter'
GROUP BY companyname'''

pd.read_sql(query, con = engine)

  companyname  count
0        Bird   3860
1        Bolt    360
2      Gotcha    224
3        Jump   1210
4        Lime   1818
5        Lyft   1735
6        Spin    805

ANSWER: The query above shows how many scooters each company had in the time frame.

In [53]:
query = '''
SELECT *
FROM scooters
LIMIT 1'''

scooter1 = pd.read_sql(query, con = engine)

In [54]:
scooter1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pubdatetime  1 non-null      datetime64[ns]
 1   latitude     1 non-null      float64
 2   longitude    1 non-null      float64
 3   sumdid       1 non-null      object
 4   sumdtype     1 non-null      object
 5   chargelevel  1 non-null      float64
 6   sumdgroup    1 non-null      object
 7   costpermin   1 non-null      float64
 8   companyname  1 non-null      object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 200.0+ bytes

In [61]:
query = '''
SELECT 
    companyname,
    EXTRACT('MONTH' FROM pubdatetime) AS month,
    COUNT(DISTINCT sumdid)
FROM scooters
WHERE sumdgroup ilike 'scooter'
GROUP BY companyname, EXTRACT('MONTH' FROM pubdatetime);
'''

with engine.connect() as connection:
    scoots = pd.read_sql(text(query), con = connection)

In [62]:
scoots

   companyname  month  count
0         Bird    5.0   3064
1         Bird    6.0   2910
2         Bird    7.0   2583
3         Bolt    5.0    346
4         Bolt    6.0    333
5         Bolt    7.0    276
6       Gotcha    5.0    223
7       Gotcha    6.0    223
8       Gotcha    7.0    224
9         Jump    5.0    976
10        Jump    6.0   1036
11        Jump    7.0   1206
12        Lime    5.0   1631
13        Lime    6.0   1455
14        Lime    7.0    902
15        Lyft    5.0   1376
16        Lyft    6.0   1152
17        Lyft    7.0   1026
18        Spin    5.0    687
19        Spin    6.0    713
20        Spin    7.0    570

ANSWER: The dataframe above shows how much the number of scooters for each company changed over the time frame.

In [77]:
number1 = trips[['companyname','tripduration']].groupby('companyname').mean('tripduration')
number1

               tripduration
companyname
Bird              13.396196
Bolt Mobility   1408.017222
Gotcha            10.196918
JUMP              32.779447
Lime              15.540224
Lyft              16.004244
SPIN              26.141509

ANSWER: The above dataframe shows how much scooter usage has varied by company.

2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:  
* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours  
Are the scooter companies in compliance with the second and third part of this rule?

In [132]:
trips.sort_values('pubtimestamp',ascending=False)

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt,MM-DD
565521,2019-08-01 07:04:00.000,JUMP,JMP34,Powered784fcc92-bd1a-5f6a-8314-b02aa21b4bfa,209.409650,14889.60000,2019-07-31,22:19:08,2019-08-01,01:48:33,36.160050,-86.776720,36.163410,-86.782100,"[('36.160051', '-86.77672'), ('36.160051', '-8...",2019-08-02 08:24:22.000,08-01
565520,2019-08-01 07:04:00.000,JUMP,JMP35,Poweredf077a919-d569-5e70-8ca7-71d179ffacf9,142.345610,20433.60000,2019-07-31,23:26:15,2019-08-01,01:48:35,36.155735,-86.775185,36.173904,-86.785450,"[('36.155736', '-86.775181'), ('36.155531', '-...",2019-08-02 08:24:21.967,08-01
565519,2019-08-01 04:53:48.000,JUMP,JMP1,Poweredb8a3a269-d1ca-571f-9b2f-89b7399b5537,18.440650,7920.00000,2019-07-31,23:41:52,2019-08-01,00:00:18,36.153687,-86.784580,36.164158,-86.776900,"[('36.153685', '-86.784578'), ('36.153685', '-...",2019-08-02 08:21:26.803,08-01
565518,2019-08-01 04:53:48.000,JUMP,JMP2,Powereda4712099-5e55-5332-996c-d6e5c910535d,3.154917,1320.00000,2019-07-31,23:57:19,2019-08-01,00:00:28,36.153015,-86.783585,36.152843,-86.779594,"[('36.153016', '-86.783586'), ('36.153016', '-...",2019-08-02 08:21:26.773,08-01
565517,2019-08-01 04:53:48.000,JUMP,JMP3,Powered5614e4fc-1971-5e5c-a545-0fd88cd3331d,17.497950,7075.20000,2019-07-31,23:47:43,2019-08-01,00:05:13,36.154633,-86.798340,36.149220,-86.813980,"[('36.154631', '-86.798341'), ('36.154631', '-...",2019-08-02 08:21:27.127,08-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5,2019-05-01 00:05:55.570,Bird,BRD2167,PoweredEJF1K,3.000000,984.25200,2019-05-01,00:03:56.546666,2019-05-01,00:06:45.786666,36.154400,-86.786200,36.151500,-86.784400,"[(36.154368, -86.785909), (36.151689, -86.7843...",2019-05-02 05:30:24.317,05-01
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.000000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.177800,-86.786600,36.177400,-86.787600,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207,05-01
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.000000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.149400,-86.779500,36.153100,-86.779600,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237,05-01
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.715600,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.157970,-86.778960,36.160540,-86.776890,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757,05-01
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.000000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.157100,-86.803600,36.156600,-86.806700,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780,05-01

ANSWER: There are trips over 24 hours and under 1 minute, so no, scooter companies are not in compliance with this rule.

3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

In [85]:
trips['MM-DD'] = trips['pubtimestamp'].dt.strftime('%m-%d')

In [86]:
trips['MM-DD']

0         05-01
1         05-01
2         05-01
3         05-01
4         05-01
          ...
565517    08-01
565518    08-01
565519    08-01
565520    08-01
565521    08-01
Name: MM-DD, Length: 565522, dtype: object

In [127]:
number3 = trips[['MM-DD','sumdid','companyname']].groupby(['MM-DD','sumdid'])

In [128]:
number3 = number3.value_counts().reset_index()

In [129]:
number3

        MM-DD                                       sumdid companyname  count
0       05-01                                Powered003176        Lyft      1
1       05-01                                Powered005832        Lyft      1
2       05-01                                Powered009634        Lyft      1
3       05-01                                Powered013719        Lyft      1
4       05-01                                Powered020762        Lyft      2
...       ...                                          ...         ...    ...
202384  08-01                                 PoweredYTT8X        Bird      1
202385  08-01  Powereda4712099-5e55-5332-996c-d6e5c910535d        JUMP      1
202386  08-01  Poweredb8a3a269-d1ca-571f-9b2f-89b7399b5537        JUMP      1
202387  08-01  Poweredd913663d-659b-5afd-9a37-a1b85c6a36b2        JUMP      1
202388  08-01  Poweredf077a919-d569-5e70-8ca7-71d179ffacf9        JUMP      1

[202389 rows x 4 columns]

In [131]:
number3.groupby(['MM-DD','companyname'])['count'].mean()

MM-DD  companyname
05-01  Bird             1.546218
       Lyft             2.707617
05-02  Bird             1.612946
       Lime             4.708013
       Lyft             2.291855
                          ...
08-01  Bolt Mobility    1.000000
       JUMP             1.000000
       Lime             1.000000
       Lyft             1.000000
       SPIN             1.000000
Name: count, Length: 528, dtype: float64